Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: The :attr:`tp_getattr` handler is called when the object requires an attribute look-up. It is called in the same situations where the :meth:`__getattr__` method of a class would be called.
pl: Sposób postępowania obsługi właściwości :attr:`tp_getattr` jest wzywany gdy przedmiot wymaga podejrzenia wartości właściwości. Jest wzywany w tych samych sytuacjach, gdzie sposób postępowania :meth:`__getattr__` byłoby wezwane.

source: Here is an example::
pl: Tu jest przykład::

source: static PyObject * newdatatype_getattr(newdatatypeobject *obj, char *name) { if (strcmp(name, "data") == 0) { return PyInt_FromLong(obj->data); } PyErr_Format(PyExc_AttributeError, "'%.50s' object has no attribute '%.400s'", tp->tp_name, name); return NULL; }
pl: static PyObject * newdatatype_getattr(newdatatypeobject *obj, char *name) { if (strcmp(name, "data") == 0) { return PyInt_FromLong(obj->data); } PyErr_Format(PyExc_AttributeError, "'%.50s' przedmiot nie ma właściwości '%.400s'", tp->tp_name, name); return NULL; }

source: The :attr:`tp_setattr` handler is called when the :meth:`__setattr__` or :meth:`__delattr__` method of a class instance would be called. When an attribute should be deleted, the third parameter will be *NULL*. Here is an example that simply raises an exception; if this were really all you wanted, the :attr:`tp_setattr` handler should be set to *NULL*. ::
pl: Obsługa właściwości :attr:`tp_setattr` jest wywoływana gdy sposoby postępowania :meth:`__setattr__` lub :meth:`__delattr__` przykładu uogólnienia byłyby wzywane. Gdy właściwość powinna być skasowana, trzeci parametr będzie *NULL*. Tutaj jest przykład, który prosto wywołuje wyjątek; jeśli to byłoby wszystkim czego potrzebujesz, obsługa :attr:`tp_setattr` powinna być ustawiona na *NULL*. ::

source: static int newdatatype_setattr(newdatatypeobject *obj, char *name, PyObject *v) { (void)PyErr_Format(PyExc_RuntimeError, "Read-only attribute: \%s", name); return -1; }
pl: static int newdatatype_setattr(newdatatypeobject *obj, char *name, PyObject *v) { (void)PyErr_Format(PyExc_RuntimeError, "właściwość tylko-do-odczytu: \%s", name); return -1; }

source: Object Comparison
pl: Porównywanie przedmiotów

source: The :attr:`tp_richcompare` handler is called when comparisons are needed. It is analogous to the :ref:`rich comparison methods <richcmpfuncs>`, like :meth:`__lt__`, and also called by :cfunc:`PyObject_RichCompare` and :cfunc:`PyObject_RichCompareBool`.
pl: sposób postępowania obsługi :attr:`tp_richcompare` jest wywoływany gdy porównania są oczekiwane. Jest to analogiczne z :ref:`sposobami postępowania bogatego porównywania <richcmpfuncs>` - z ang. - :ref:`rich comparison methods <richcmpfuncs>`, jak :meth:`__lt__` i także wzywane przez :cfunc:`PyObject_RichCompare` i :cfunc:`PyObject_RichCompareBool`.

source: This function is called with two Python objects and the operator as arguments, where the operator is one of ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GT``, ``Py_LT`` or ``Py_GT``. It should compare the two objects with respect to the specified operator and return ``Py_True`` or ``Py_False`` if the comparison is successfull, ``Py_NotImplemented`` to indicate that comparison is not implemented and the other object's comparison method should be tried, or *NULL* if an exception was set.
pl: To zadanie jest wzywane z dwoma przedmiotami języka pytonowskiego i operatorem jako parametrami, gdzie operator jest jednym z ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GT``, ``Py_LT`` lub ``Py_GT``. Powinno porównywać dwa przedmioty z uwzględnieniem wyszczególnionego operatora i zwracać ``Py_True`` lub ``Py_False`` jeśli porównanie jest udane, ``Py_NotImplemented`` aby zaznaczyć że porównanie nie jest wypełnione i że inny sposób porównania przedmiotów powinien być wypróbowany, lub *NULL* jeśli wyjątek został ustawiony.

source: Here is a sample implementation, for a datatype that is considered equal if the size of an internal pointer is equal::
pl: Tu jest przykładowe wypełnienie, dla typu danych który jest uznawany za równy, jeśli rozmiar wewnętrznego wskaźnika jest równy::

source: static int newdatatype_richcmp(PyObject *obj1, PyObject *obj2, int op) { PyObject *result; int c, size1, size2; /* code to make sure that both arguments are of type newdatatype omitted */ size1 = obj1->obj_UnderlyingDatatypePtr->size; size2 = obj2->obj_UnderlyingDatatypePtr->size; switch (op) { case Py_LT: c = size1 < size2; break; case Py_LE: c = size1 <= size2; break; case Py_EQ: c = size1 == size2; break; case Py_NE: c = size1 != size2; break; case Py_GT: c = size1 > size2; break; case Py_GE: c = size1 >= size2; break; } result = c ? Py_True : Py_False; Py_INCREF(result); return result; }
pl: static int newdatatype_richcmp(PyObject *obj1, PyObject *obj2, int op) { PyObject *result; int c, size1, size2; /* kod do upewnienia się że oba parametry są typu newdatatype pominięty */ size1 = obj1->obj_UnderlyingDatatypePtr->size; size2 = obj2->obj_UnderlyingDatatypePtr->size; switch (op) { case Py_LT: c = size1 < size2; break; case Py_LE: c = size1 <= size2; break; case Py_EQ: c = size1 == size2; break; case Py_NE: c = size1 != size2; break; case Py_GT: c = size1 > size2; break; case Py_GE: c = size1 >= size2; break; } result = c ? Py_True : Py_False; Py_INCREF(result); return result; }

source: Abstract Protocol Support
pl: Wsparcie protokołu abstrakcyjnego

source: Python supports a variety of *abstract* 'protocols;' the specific interfaces provided to use these interfaces are documented in :ref:`abstract`.
pl: Język pytonowski wspiera różne *abstrakcyjne* 'protokoły;' szczegółowe sprzęgi dostarczone do użycia tych sprzęgów są udokumentowane w :ref:`abstract` - z ang. - :ref:`abstrakt`.

source: A number of these abstract interfaces were defined early in the development of the Python implementation. In particular, the number, mapping, and sequence protocols have been part of Python since the beginning. Other protocols have been added over time. For protocols which depend on several handler routines from the type implementation, the older protocols have been defined as optional blocks of handlers referenced by the type object. For newer protocols there are additional slots in the main type object, with a flag bit being set to indicate that the slots are present and should be checked by the interpreter. (The flag bit does not indicate that the slot values are non-*NULL*. The flag may be set to indicate the presence of a slot, but a slot may still be unfilled.) ::
pl: Pewna część z tych abstrakcyjnych sprzęgów została zdefiniowana wcześnie w czasie tworzenia wypełnienia języka pytonowskiego. W szczególności protokoły liczbowy, mapowania i sekwencyjny były częścią języka pytonowskiego od początku. Inne protokoły były dodawane później. Dla protokołów, które zależą od kilku sposobów postępowania z wypełnienia typu, starsze protokoły zostały zdefiniowane jako opcjonalne bloki uchwytów obsługi do których odnosi się przedmiot typu. Dla nowszych protokołów istnieją dodatkowe gniazda w głównym przedmiocie typu, z bitem flagi ustawionym aby wskazywać że gniazda są obecne i powinny być sprawdzane przez program interpretujący polecenia języka pytonowskiego. (Bit flagi nie wskazuje, że wartości gniazd są niepuste - (non-*NULL*). Flaga może zostać ustawiona aby wskazać obecność gniazda, ale gniazdo wciąż może być niezapełnione.) ::

source: If you wish your object to be able to act like a number, a sequence, or a mapping object, then you place the address of a structure that implements the C type :ctype:`PyNumberMethods`, :ctype:`PySequenceMethods`, or :ctype:`PyMappingMethods`, respectively. It is up to you to fill in this structure with appropriate values. You can find examples of the use of each of these in the :file:`Objects` directory of the Python source distribution. ::
pl: Jeśli wolisz aby twój przedmiot był w stanie działać jak liczba, sekwencja, lub przedmiot mapujący, wtedy umieszczasz adres struktury która wypełnia zadania typu C :ctype:`PyNumberMethods`, :ctype:`PySequenceMethods`, lub :ctype:`PyMappingMethods`, odpowiednio. To już zależy od Ciebie, aby wypełnić tą strukturę odpowiednimi wartościami. Można znaleźć przykłady użycia każdego z tych w katalogu :file:`Objects` dystrybucji źródłowej języka pytonowskiego. ::

source: This function, if you choose to provide it, should return a hash number for an instance of your data type. Here is a moderately pointless example::
pl: To zadanie, jeśli wybierzesz aby je dostarczyć, powinno zwrócić numer hash dla przykładu twojego typu danych. Tu jest umiarkowanie bezużyteczny przykład::

source: This function is called when an instance of your data type is "called", for example, if ``obj1`` is an instance of your data type and the Python script contains ``obj1('hello')``, the :attr:`tp_call` handler is invoked.
pl: To zadanie jest wzywane gdy przykład twojego typu danych jest "wzywany", dla przykładu, jeśli ``obj1`` jest przykładem twojego typu danych i skrypt języka pytonowskiego zawiera ``obj1('hello')``, uchwyt obsługi :attr:`tp_call` jest wywoływany.

source: This function takes three arguments:
pl: To zadanie pobiera trzy parametry:

source: *arg1* is the instance of the data type which is the subject of the call. If the call is ``obj1('hello')``, then *arg1* is ``obj1``.
pl: *arg1* jest przykładem typu danych który jest przedmiotem wywołania. Jeśli wywołanie jest ``obj1('hello')``, wtedy *arg1* jest ``obj1``.

source: *arg2* is a tuple containing the arguments to the call. You can use :cfunc:`PyArg_ParseTuple` to extract the arguments.
pl: *arg2* jest krotką zawierającą parametry wywołania. Można użyć :cfunc:`PyArg_ParseTuple` aby wydobyć parametry.

source: *arg3* is a dictionary of keyword arguments that were passed. If this is non-*NULL* and you support keyword arguments, use :cfunc:`PyArg_ParseTupleAndKeywords` to extract the arguments. If you do not want to support keyword arguments and this is non-*NULL*, raise a :exc:`TypeError` with a message saying that keyword arguments are not supported.
pl: *arg3* jest słownikiem parametrów słów kluczowych które zostały przekazane. Jeśli to jest niepuste ( - z ang. - non-*NULL*) a ty wspierasz parametry słów kluczowych, użyj :cfunc:`PyArg_ParseTupleAndKeywords` aby wydobyć parametry. Jeśli nie chcesz wspierać parametrów słów kluczowych i to jest niepuste (non-*NULL*), zgłoś :exc:`TypeError` z wiadomością mówiącą że parametry słów kluczowych nie są wspierane.

source: Here is a desultory example of the implementation of the call function. ::
pl: Tu jest niepełny przykład wypełnienia wywołania zadania. ::

source: /* Implement the call function. * obj1 is the instance receiving the call. * obj2 is a tuple containing the arguments to the call, in this * case 3 strings. */ static PyObject * newdatatype_call(newdatatypeobject *obj, PyObject *args, PyObject *other) { PyObject *result; char *arg1; char *arg2; char *arg3; if (!PyArg_ParseTuple(args, "sss:call", &arg1, &arg2, &arg3)) { return NULL; } result = PyString_FromFormat( "Returning -- value: [\%d] arg1: [\%s] arg2: [\%s] arg3: [\%s]\n", obj->obj_UnderlyingDatatypePtr->size, arg1, arg2, arg3); printf("\%s", PyString_AS_STRING(result)); return result; }
pl: /* Wypełnienie zadania wywołania. * obj1 jest przykładem otrzymującym wywołanie. * obj2 jest krotką zawierającą parametry wywołania, w tym przypadku 3 ciągi znaków. */ static PyObject * newdatatype_call(newdatatypeobject *obj, PyObject *args, PyObject *other) { PyObject *result; char *arg1; char *arg2; char *arg3; if (!PyArg_ParseTuple(args, "sss:call", &arg1, &arg2, &arg3)) { return NULL; } result = PyString_FromFormat( "Powrotne -- wartość: [\%d] arg1: [\%s] arg2: [\%s] arg3: [\%s]\n", obj->obj_UnderlyingDatatypePtr->size, arg1, arg2, arg3); printf("\%s", PyString_AS_STRING(result)); return result; }

source: XXX some fields need to be added here... ::
pl: XXX niektóre pola powinny być tu dodane... ::

source: /* Iterators */ getiterfunc tp_iter; iternextfunc tp_iternext;
pl: /* Iteratory */ getiterfunc tp_iter; iternextfunc tp_iternext;

source: These functions provide support for the iterator protocol. Any object which wishes to support iteration over its contents (which may be generated during iteration) must implement the ``tp_iter`` handler. Objects which are returned by a ``tp_iter`` handler must implement both the ``tp_iter`` and ``tp_iternext`` handlers. Both handlers take exactly one parameter, the instance for which they are being called, and return a new reference. In the case of an error, they should set an exception and return *NULL*.
pl: Te zadania dostarczają wsparcia dla protokołu iteratora. Każdy przedmiot który chce wspierać iterację po swojej zawartości (która może być tworzona w czasie iteracji) musi wypełnić uchwyt obsługi ``tp_iter``. Przedmioty, które są zwracane przez obsługę ``tp_iter`` muszą wypełniać uchwyty obsługi zarówno ``tp_iter``, jak i ``tp_iternext``. Oba uchwyty obsługi pobierają dokładnie jeden parametr, przykład dla którego zostały wywołane, i zwracają nowe odniesienie. W przypadku błędu, powinny ustawiać wyjątek i zwracać *NULL*.

source: For an object which represents an iterable collection, the ``tp_iter`` handler must return an iterator object. The iterator object is responsible for maintaining the state of the iteration. For collections which can support multiple iterators which do not interfere with each other (as lists and tuples do), a new iterator should be created and returned. Objects which can only be iterated over once (usually due to side effects of iteration) should implement this handler by returning a new reference to themselves, and should also implement the ``tp_iternext`` handler. File objects are an example of such an iterator.
pl: Dla przedmiotu który reprezentuje możliwą do iterowania kolekcję, uchwyt obsługi ``tp_iter`` musi zwracać przedmiot iterujący. Przedmiot iterujący jest odpowiedzialny za utrzymywanie stanu iteracji. Dla kolekcji które mogą wspierać wiele przedmiotów iterujących, które nie nachodzą na siebie (tak jak listy i krotki), nowy przedmiot iterujący powinien być utworzony i zwrócony. Przedmioty które mogą tylko być iterowane raz (zwykle z powodu efektów ubocznych iteracji) powinny wypełniać ten uchwyt obsługi, przez zwrócenie nowego odniesienia do nich samych i powinny także wypełniać uchwyt obsługi ``tp_iternext``. Przedmioty pliku są przykładami takich przedmiotów iterujących.

source: Iterator objects should implement both handlers. The ``tp_iter`` handler should return a new reference to the iterator (this is the same as the ``tp_iter`` handler for objects which can only be iterated over destructively). The ``tp_iternext`` handler should return a new reference to the next object in the iteration if there is one. If the iteration has reached the end, it may return *NULL* without setting an exception or it may set :exc:`StopIteration`; avoiding the exception can yield slightly better performance. If an actual error occurs, it should set an exception and return *NULL*.
pl: Przedmioty iterujące powinny wypełniać oba uchwyty obsługujące. Uchwyt obsługi ``tp_iter`` powinien zwracać nowe odniesienie do przedmiotu iterującego (to jest tak samo jak dla uchwytu obsługi ``tp_iter`` dla przedmiotów, które mogą tylko iterować destrukcyjnie). Uchwyt obsługi ``tp_iternext`` powinien zwracać nowe odniesienie do następnego przedmiotu w iteracji jeśli jest taki. Jeśli iteracja dobiegła końca, może zwrócić *NULL* bez ustawiania wyjątku lub może ustawić wyjątek :exc:`StopIteration`; pominięcie wyjątku może dawać nieco lepsze wyniki czasu działania. Jeśli właściwe błędy nastąpią, powinno się ustawić wyjątek i zwrócić *NULL*.

source: Weak Reference Support
pl: Wsparcie dla słabych odniesień

source: One of the goals of Python's weak-reference implementation is to allow any type to participate in the weak reference mechanism without incurring the overhead on those objects which do not benefit by weak referencing (such as numbers).
pl: Jednym z celów wypełnienia słabych odniesień języka pytonowskiego jest pozwolenie aby jakikolwiek typ brał udział w mechanizmie słabych odniesień bez powodowania nadwyżki obliczeń na tych przedmiotach które nie korzystają ze słabych odniesień (takich jak liczby).

source: For an object to be weakly referencable, the extension must include a :ctype:`PyObject\*` field in the instance structure for the use of the weak reference mechanism; it must be initialized to *NULL* by the object's constructor. It must also set the :attr:`tp_weaklistoffset` field of the corresponding type object to the offset of the field. For example, the instance type is defined with the following structure::
pl: Dla przedmiotu aby można było słabo się do niego odnieść, rozszerzenie musi zawierać pole :ctype:`PyObject\*` w strukturze przykładu dla użycia mechanizmu słabych odniesień; musi być zainicjowane na *NULL* przez konstruktor przedmiotu. Musi też ustawiać pole :attr:`tp_weaklistoffset` odpowiadającego przedmiotu typu na przesunięcie względne pola. Dla przykładu, typ przykładu jest określony z następującą strukturą::

source: typedef struct { PyObject_HEAD PyClassObject *in_class; /* The class object */ PyObject *in_dict; /* A dictionary */ PyObject *in_weakreflist; /* List of weak references */ } PyInstanceObject;
pl: typedef struct { PyObject_HEAD PyClassObject *in_class; /* Przedmiot uogólnienia */ PyObject *in_dict; /* Słownik */ PyObject *in_weakreflist; /* Lista słabych odniesień */ } PyInstanceObject;

source: The statically-declared type object for instances is defined this way::
pl: Statycznie-określony typ przedmiotu dla przykładów jest określony w ten sposób::

source: PyTypeObject PyInstance_Type = { PyVarObject_HEAD_INIT(&PyType_Type, 0) 0, "module.instance", /* Lots of stuff omitted for brevity... */ Py_TPFLAGS_DEFAULT, /* tp_flags */ 0, /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ offsetof(PyInstanceObject, in_weakreflist), /* tp_weaklistoffset */ };
pl: PyTypeObject PyInstance_Type = { PyVarObject_HEAD_INIT(&PyType_Type, 0) 0, "module.instance", /* Mnóstwo rzeczy pominięte dla skrótowości... */ Py_TPFLAGS_DEFAULT, /* tp_flags */ 0, /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ offsetof(PyInstanceObject, in_weakreflist), /* tp_weaklistoffset */ };

source: The type constructor is responsible for initializing the weak reference list to *NULL*::
pl: Konstruktor jest odpowiedzialny za zainicjowanie listy słabych odniesień na *NULL*::

source: static PyObject * instance_new() { /* Other initialization stuff omitted for brevity */ self->in_weakreflist = NULL; return (PyObject *) self; }
pl: static PyObject * instance_new() { /* Inne sprawy inicjowania pominięte dla skrótowości */ self->in_weakreflist = NULL; return (PyObject *) self; }

source: The only further addition is that the destructor needs to call the weak reference manager to clear any weak references. This should be done before any other parts of the destruction have occurred, but is only required if the weak reference list is non-*NULL*::
pl: Jedyny dalszy dodatek jest tym że destruktor potrzebuje wezwać zarządcę słabych odniesień aby wyczyścił jakiekolwiek słabe odniesienia. To powinno być zrobione przed tym jak jakiekolwiek inne części destrukcji nastąpiły, ale jest wymagane tylko jeśli lista słabych odniesień jest nie pusta - z ang. - non-*NULL*::

source: static void instance_dealloc(PyInstanceObject *inst) { /* Allocate temporaries if needed, but do not begin destruction just yet. */ if (inst->in_weakreflist != NULL) PyObject_ClearWeakRefs((PyObject *) inst); /* Proceed with object destruction normally. */ }
pl: static void instance_dealloc(PyInstanceObject *inst) { /* Przeznacz miejsce dla tymczasowych jeśli potrzeba, ale nie zaczynaj destrukcji jeszcze w tej chwili. */ if (inst->in_weakreflist != NULL) PyObject_ClearWeakRefs((PyObject *) inst); /* Postępuj z destrukcją przedmiotów normalnie. */ }

source: More Suggestions
pl: Więcej sugestii

source: Remember that you can omit most of these functions, in which case you provide ``0`` as a value. There are type definitions for each of the functions you must provide. They are in :file:`object.h` in the Python include directory that comes with the source distribution of Python.
pl: Pamiętaj że możesz pominąć większość z tych zadań, w którym to przypadku, dostarczysz ``0`` jako wartość. Istnieją definicje typu dla każdego zadania które musisz dostarczyć. Są one w pliku :file:`object.h` w katalogu załączania języka pytonowskiego, który dostarczony jest w źródłowej dystrybucji języka pytonowskiego.

source: In order to learn how to implement any specific method for your new data type, do the following: Download and unpack the Python source distribution. Go to the :file:`Objects` directory, then search the C source files for ``tp_`` plus the function you want (for example, ``tp_richcompare``). You will find examples of the function you want to implement.
pl: W celu nauczenia się jak wypełniać jakiekolwiek szczególne metody dla twojego nowego typu danych, wykonaj poniższe: Ściągnij i rozpakuj dystrybucję źródłową języka pytonowskiego. Przejdź do katalogu :file:`Objects`, a następnie przeszukaj pliki źródłowe C w poszukiwaniu ``tp_`` plus nazwę zadania której potrzebujesz (na przykład, ``tp_richcompare``). Znajdziesz przykłady zadań, które chcesz wypełnić.

source: When you need to verify that an object is an instance of the type you are implementing, use the :cfunc:`PyObject_TypeCheck` function. A sample of its use might be something like the following::
pl: Kiedy potrzebujesz zweryfikować że przedmiot jest przykładem typu który wypełniasz, użyj zadania :cfunc:`PyObject_TypeCheck`. Przykład jego użycia mógłby być czymś następującym::

source: if (! PyObject_TypeCheck(some_object, &MyType)) { PyErr_SetString(PyExc_TypeError, "arg #1 not a mything"); return NULL; }
pl: if (! PyObject_TypeCheck(some_object, &MyType)) { PyErr_SetString(PyExc_TypeError, "arg #1 nie moja rzecz"); return NULL; }

source: This is true when we know that the object is a basic type, like a string or a float.
pl: To jest prawdziwe gdy wiemy że przedmiot jest typem bazowym, jak ciąg znaków lub liczba zmiennoprzecinkowa.

source: We relied on this in the :attr:`tp_dealloc` handler in this example, because our type doesn't support garbage collection. Even if a type supports garbage collection, there are calls that can be made to "untrack" the object from garbage collection, however, these calls are advanced and not covered here.
pl: Oparliśmy się na tym w uchwycie obsługi :attr:`tp_dealloc` w tym przykładzie, ponieważ nasz typ nie wspiera zbierania śmieci. Nawet jeśli typ wspiera zbieranie śmieci, istnieją wywołania którymi można uczynić przedmiot "nieśledzonym" przez zbiórkę śmieci, jednakże, te wywołania są zaawansowane i nie są omawiane tutaj.

source: We now know that the first and last members are strings, so perhaps we could be less careful about decrementing their reference counts, however, we accept instances of string subclasses. Even though deallocating normal strings won't call back into our objects, we can't guarantee that deallocating an instance of a string subclass won't call back into our objects.
pl: Teraz wiemy, że pierwszy i ostatni członek są ciągami znaków, więc być może moglibyśmy być mniej ostrożni w temacie zmniejszania ich liczby odniesień, jednakże, akceptujemy przykłady podrzędnych uogólnień ciągu znaków. Nawet chociaż odbieranie przydzielonego miejsca w pamięci dla normalnych ciągów znaków nie daje wywołania wstecznego do naszych przedmiotów, nie możemy zagwarantować, że zabranie miejsca w pamięci dla przykładu ciągu znaków nie wywoła wstecznie do naszego przedmiotu.
